In [64]:
import pandas as pd

In [65]:
df=pd.read_csv("Resources/ACS_14_1YR_S1903_with_ann.csv")

In [66]:
df = df.iloc[:,[0,2,5]]
df = df.drop([0])
df = df.rename(columns={'GEO.id': 'id', 'GEO.display-label': 'state','HC02_EST_VC02':"median_income"})
df.head()

            id       state median_income
1  0400000US01     Alabama         42830
2  0400000US02      Alaska         71583
3  0400000US04     Arizona         50068
4  0400000US05    Arkansas         41262
5  0400000US06  California         61933

In [67]:
df1=pd.read_csv("Resources/BRFSS_2014_Overall.csv")

In [68]:
df1=df1.loc[df1['Response']== "Yes"]
df1=df1.iloc[:,[1,2,10]]
df1 = df1.rename(columns={'Locationabbr': 'abbr', 'Locationdesc': 'state','Data_value':"depression"})
df1.head()

  abbr       state  depression
0   AL     Alabama        21.3
2   AK      Alaska        15.6
4   AZ     Arizona        18.7
6   AR    Arkansas        21.5
8   CA  California        13.3

In [69]:
data = pd.merge(df, df1, on='state')
data = data.iloc[:,[0,1,3,2,4]]
data.head()

            id       state abbr median_income  depression
0  0400000US01     Alabama   AL         42830        21.3
1  0400000US02      Alaska   AK         71583        15.6
2  0400000US04     Arizona   AZ         50068        18.7
3  0400000US05    Arkansas   AR         41262        21.5
4  0400000US06  California   CA         61933        13.3

In [72]:
data.to_csv('Data/data.csv')